todos/app/controllers/api/todos_controller.rb

  def update
    @todo = Todo.find(params[:id])
    if @todo.update_attributes(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2018-10-03 00:17:15.165288"], ["id", 17]]